from random import randint
from time import sleep

def out_red(text):
    print("\033[31m\033[47m{}".format(text))
    

class Warrior():
    def __init__(self, name):
        self.name = name
        self.health = 100
        
    def attack(self, target):
        out_red(f"Воин {self.name} атаковал воина {target.name}")
        target.health -= 20
        sleep(1)
        out_red(f"У воина {target.name} осталось {target.health} здоровья\n")
               
unit1 = Warrior("Довакин")
unit2 = Warrior("Драугр-босс")

sleep(1)

out_red("""
        :#@@%+.
       *@@@@@@=
       *@@@@@@@               
       =@@@@@@@.              
      .@@@@@@@@+              
     .*@@@@@@@@@              
   -%@@@@@@@@@@@#.            
  -@@@@@@@@@@@@@@@:           
  *@@@@@@@@@@@@@@@@@%%#+:     
  *@@@@@@@@@@@@@@@@@@@@@@@+.  
  #@@@@@@@@@@@@@@@@@@@@@@@@@- 
  +@@@@@@@@@@@@@@@@@@@@@@@@@@-
  %@@@@@@@@@@@@@@@@@@@@@@@@@@%
 =@@@@@@@@@@@@@@@@@@@@@@@@@@@@
 *@@@*@@@@@@@@@@@@@@@@@@@@@@@%
 =@@=%@@@@@@@@@@@@@@@@@@@@@@@:
 +@% @@@@@@@@@@@@@@@@@@@@@@@- 
#@@#:@@@@@@@@@@@@@@@@@@@@%=   
+@@@#@@@@@@@@@@@@@@%%#*=.     
 -@@@@@@@@@@@@@@@@#           
   .@@@@@@@@@@@@@@@+          
    @@@@*-=+*@@@@@@@-         
   .@@@@%:   +@@@@+@@.        
   *@@@%+@*.  @@@@-+@%        
   @@@@@ -@@= @@@@% #@+       
   %@@@=  .#@#@@@@@  =@.      
   *@@@.    =@@@@@@=  :.      
   +@@@=     .*@@@@-          
   :@@@:       #@@@#          
   :@@@+       *@@@@+:        
  +@@@@+       %@@@@@@@#+
\n""")

sleep(1)

out_red("Среди руин Ветренного пика, пробираясь свозь драугров, бандитов и бесконечных лабиринтов, отважный воин наконец пробирается до главного зала")

sleep(1)
out_red("и")
sleep(1)
out_red(".")
sleep(1)
out_red(".")
sleep(1)
out_red(".")
sleep(1)

out_red("И где эта каменная скрижаль?")
sleep(1)
out_red("Что за ересь выцарапана на стене?")
sleep(1)
out_red("Что происходит???\n")
sleep(5)

while True:
    if unit1.health <= 0: out_red(f"{unit1.name} повержен. Может, стоит поробовать еще раз?.."); break
    elif unit2.health <= 0: out_red(f"{unit2.name} повержен. {unit1.name} получает предмет: Драконий камень"); break
    if randint(0, 100) <= 50:
        unit1.attack(unit2)
        sleep(randint(1, 4))
    else:
        unit2.attack(unit1)
        sleep(randint(1, 4))